WELCOME_CIRCLE = (
    "DQACAgIAAxkDAAMXZ3duDIhM7mVMwTbvp-T6kj4nVWMAAkNbAALe58BLPG91DKeOO3s2BA"
)

FIRST_FILES_TITLES = (
    "- Файл с теорией по теме \"Треугольники и прямые\"\n"
    "- Файл с заданиями для самостоятельной работы\n"
    "- Видео с примерами решения заданий\n"
)
FAIL_FIRST_TEST = (
    "<b>Мы проанализировали ваши ответы на предварительный тест по геометрии и заметили"
    ", что у вас есть необходимость подтянуть некоторые знания по планиметрии.</b>\n"
    "Не стоит беспокоиться – это вполне нормальная ситуация, особенно если "
    "вы не занимались этим предметом длительное время.\n"
    "С помощью нашего курса и ваших усилий мы обязательно преодолеем эту разницу.\n\n"
    "Давайте начнем с первой темы - треугольники и прямые.\n"
    "Для того чтобы вы могли лучше подготовиться к следующему занятию,"
    f" мы отправляем вам три файла:\n{FIRST_FILES_TITLES}\n"
    "<i>Пожалуйста, внимательно изучите предоставленную информацию и "
    "выполните все задания.</i>"
)
SUCCESS_FIRST_TEST = (
    "<b>Мы очень рады увидеть уверенные знания по планиметрии в ваших ответах "
    "на предварительный тест! Это отличный старт для нашего курса геометрии.</b>\n"
    "Чтобы закрепить и углубить ваши знания, мы подготовили три дополнительных файла:"
    f"\n{FIRST_FILES_TITLES}\n"
    "<i>Пожалуйста, изучите предоставленную информацию и попробуйте решить задания. "
    "Это поможет вам не только закрепить уже известное, но и расширить свои "
    "возможности в области геометрии.</i>"
)
SECOND_LESSON = (
    "Отлично! Мы очень рады, что вы успешно прошли первую тему курса "
    "- треугольники и прямые. Ваше усердие и понимание материала очень ценны.\n"
    "Теперь, когда мы готовы, давайте перейдем к новой захватывающей теме"
    " - параллелограммы. Эта геометрическая фигура играет важную роль в математике"
    " и имеет множество практических применений.\n"
    "Для начала давайте проверим ваши теоретические знания по этому новому материалу."
)

SECOND_FILES_TITLES = (
    "- Файл с подробным объяснением основных концепций параллелограммов\n"
    "- Файл с заданиями для повторения и закрепления материала\n"
    "- Видео с примерами решения заданий\n"
)
FAIL_SECOND_TEST = (
    "Мы понимаем, что результаты теста по теме параллелограммов не полностью "
    "соответствуют вашим ожиданиям. Не стоит расстраиваться - это вполне "
    "нормальная ситуация, особенно если вы только начинаете изучать эту "
    "тему или не занимались ею длительное время.\n\n"
    "Давайте попробуем разобраться в том, что именно вызвало трудности.\n"
    f"Мы отправляем вам три файла для дополнительной подготовки:\n"
    f"{SECOND_FILES_TITLES}\n"
    f"<i>Пожалуйста, внимательно изучите предоставленную информацию "
    f"и выполните все задания.</i>"
)
SUCCESS_SECOND_TEST = (
    "<b>Вы успешно справились с тестом по теме параллелограммов!</b>\n"
    "Ваше понимание материала на высоком уровне, и это отличный результат.\n"
    "Чтобы закрепить ваши знания и углубить их, мы подготовили "
    f"три дополнительных файла:\n{SECOND_FILES_TITLES}\n\n"
    "<i>Пожалуйста, изучите предоставленную информацию и попробуйте решить задания</i>"
)
THIRD_LESSON = (
    "<b>Вы успешно прошли тему параллелограммов.</b>\n"
    "Ваше усердие и понимание материала очень ценны.\n\n"
    "Теперь, когда мы готовы, давайте перейдем к новой захватывающей теме - трапеция. "
    "Эта геометрическая фигура имеет ряд интересных свойств и применяется в "
    "различных областях математики и практике."
)
FOURTH_LESSON = (
    "<b>Отлично!</b> "
    "Мы рады, что вы успешно прошли большинство тем по планиметрии.\n\n"
    "Теперь, когда мы готовы, давайте перейдем к заключительной, "
    "но не менее захватывающей теме - окружность. "
    "Эта геометрическая фигура играет важную роль в математике и имеет "
    "множество практических применений."
)
FIFTH_LESSON = (
    "<b>Отлично!</b> Мы очень рады, что вы успешно прошли все темы по планиметрии.\n\n"
    "Теперь, когда мы готовы, давайте перейдем к новой захватывающей теме - векторы. "
    "Эта область математики открывает новые горизонты для понимания "
    "пространства и движения."
)
SIXTH_LESSON = (
    "<b>Вы успешно закончили тему векторов.</b>\n\n"
    "Теперь, когда мы готовы, давайте перейдем к новой захватывающей теме"
    " - стереометрии.\nЭта область геометрии изучает трехмерные фигуры и их свойства.\n"
    "Для начала давайте проверим ваши знания по параллелепипедам,"
    " так как эта тема является важной частью основ стереометрии."
)

THIRD_FILES_TITLES = (
    "- Файл с подробным объяснением основных концепций параллелепипедов\n"
    "- Файл с заданиями для повторения и закрепления материала\n"
    "- Видео материалы с решением задач\n"
)
SUCCESS_THIRD_TEST = (
    "Ваше глубокое понимание материала на высоком уровне, и это отличный результат.\n"
    "Чтобы закрепить ваши знания и углубить их, мы подготовили дополнительные файлы:\n"
    f"{THIRD_FILES_TITLES}\n"
    f"<i>Пожалуйста, изучите предоставленную информацию "
    f"и попробуйте решить задания.</i>"
)
FAIL_THIRD_TEST = (
    "<b>Вам стоит подтянуть свои знания по этой теме.</b>\n"
    "Но не стоит расстраиваться - это вполне нормальная ситуация, "
    "особенно если вы только начинаете изучать эту тему"
    " или не занимались ею длительное время.\n"
    "Давайте попробуем разобраться в том, что именно вызвало трудности.\n\n"
    f"Мы отправляем вам файлы для дополнительной подготовки:\n{THIRD_FILES_TITLES}\n"
    "<i>Пожалуйста, внимательно изучите предоставленную информацию "
    "и выполните все задания.</i>"
)

SEVENTH_LESSON = (
    "Теперь, когда мы готовы, давайте перейдем к заключительной "
    "части нашего курса по стереометрии - пирамидам и тетраэдрам."
)
FINAL_TEST = (
    "Поздравляем! Вы успешно прошли все темы курса по геометрии.\n"
    "Теперь вы готовы к финальному тесту, который поможет вам закрепить "
    "и проверить свои знания по всем темам."
)
FINAL_TEST_DONE = (
    "<b>Мы хотели бы искренне поблагодарить каждого из вас за "
    "ваш вклад в наш курс геометрии.</b>\n\n"
    "Ваше усердие, любопытство и стремление к знаниям были ключевыми факторами"
    " в создании такого продуктивного и увлекательного учебного процесса.\n\n"
    "<b>Спасибо вам за то, что выбрали этот курс.</b>\n"
    "Ваше участие показало, что вы цените глубокое понимание геометрических концепций "
    "и их применения в реальной жизни. Это было приятно наблюдать, как вы "
    "развиваете свои математические навыки и расширяете свои горизонты мышления.\n\n"
    "<b>Если вы хотите пройти финальный тест заново - нажмите кнопку ниже!</b>"
)